test0/20k.txt
Namespace(backend='vllm', base_url=None, host='localhost', port=8000, endpoint='/v1/completions', dataset=None, dataset_name='random', dataset_path=None, model='/root/Qwen2.5-32B-Instruct-GPTQ-Int8', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=50, logprobs=None, request_rate=inf, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=0, random_output_len=150, random_range_ratio=1.0, random_prefix_len=20480, hf_subset=None, hf_split=None, hf_output_len=None)
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
============ Serving Benchmark Result ============
Successful requests:                     50        
Benchmark duration (s):                  175.05    
Total input tokens:                      1024000   
Total generated tokens:                  7412      
Request throughput (req/s):              0.29      
Output token throughput (tok/s):         42.34     
Total Token throughput (tok/s):          5892.27   
---------------Time to First Token----------------
Mean TTFT (ms):                          88310.67  
Median TTFT (ms):                        88145.85  
P99 TTFT (ms):                           168425.01 
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          75.31     
Median TPOT (ms):                        76.06     
P99 TPOT (ms):                           79.74     
---------------Inter-token Latency----------------
Mean ITL (ms):                           75.51     
Median ITL (ms):                         73.97     
P99 ITL (ms):                            104.66    
==================================================