test0/80k.txt
Namespace(backend='vllm', base_url=None, host='localhost', port=8000, endpoint='/v1/completions', dataset=None, dataset_name='random', dataset_path=None, model='/root/Qwen2.5-32B-Instruct-GPTQ-Int8', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=50, logprobs=None, request_rate=inf, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=0, random_output_len=150, random_range_ratio=1.0, random_prefix_len=81920, hf_subset=None, hf_split=None, hf_output_len=None)
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
============ Serving Benchmark Result ============
Successful requests:                     50        
Benchmark duration (s):                  902.09    
Total input tokens:                      4096000   
Total generated tokens:                  7100      
Request throughput (req/s):              0.06      
Output token throughput (tok/s):         7.87      
Total Token throughput (tok/s):          4548.42   
---------------Time to First Token----------------
Mean TTFT (ms):                          459072.32 
Median TTFT (ms):                        458606.73 
P99 TTFT (ms):                           887610.16 
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          39.63     
Median TPOT (ms):                        39.83     
P99 TPOT (ms):                           41.48     
---------------Inter-token Latency----------------
Mean ITL (ms):                           37.97     
Median ITL (ms):                         37.60     
P99 ITL (ms):                            64.06     
==================================================