test0/8k.txt
Namespace(backend='vllm', base_url=None, host='localhost', port=8000, endpoint='/v1/completions', dataset=None, dataset_name='random', dataset_path=None, model='/root/Qwen2.5-32B-Instruct-GPTQ-Int8', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=1000, logprobs=None, request_rate=inf, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=0, random_output_len=150, random_range_ratio=1.0, random_prefix_len=8192, hf_subset=None, hf_split=None, hf_output_len=None)
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
============ Serving Benchmark Result ============
Successful requests:                     992       
Benchmark duration (s):                  1330.54   
Total input tokens:                      8126464   
Total generated tokens:                  148680    
Request throughput (req/s):              0.75      
Output token throughput (tok/s):         111.74    
Total Token throughput (tok/s):          6219.37   
---------------Time to First Token----------------
Mean TTFT (ms):                          671998.72 
Median TTFT (ms):                        670972.27 
P99 TTFT (ms):                           1312203.62
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          75.70     
Median TPOT (ms):                        75.74     
P99 TPOT (ms):                           80.90     
---------------Inter-token Latency----------------
Mean ITL (ms):                           76.28     
Median ITL (ms):                         73.87     
P99 ITL (ms):                            111.60    
==================================================